app/controllers/eat_controller.rb

  def show
  	@articles = Article.all
---
SELECT "articles".* FROM "articles"